IDEA Open Model
Region2D.Openings Property
 Gets or sets the list of openings in the Region2D.
 Namespace: IdeaRS.OpenModel.Geometry2D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public List<PolyLine2D> Openings { get; set; }
Public Property Openings As List(Of PolyLine2D)
	Get
	Set
public:
property List<PolyLine2D^>^ Openings {
	List<PolyLine2D^>^ get ();
	void set (List<PolyLine2D^>^ value);
}
Property Value
Type: List<PolyLine2D>
See Also
Reference
Region2D Class
IdeaRS.OpenModel.Geometry2D Namespace